cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'starkandwayne/cf'
tap 'weaveworks/tap'

brew 'ansible'
brew 'ansible-lint'
brew 'antigen'
brew 'awscli'
brew 'bash-completion'
brew 'cfssl'
brew 'chruby'
brew 'go'
brew 'docker-credential-helper-ecr'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'istioctl'
brew 'jq'
brew 'kafka'
brew 'kind'
brew 'kops'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubespy'
brew 'kustomize'
brew 'mas'
brew 'nmap'
brew 'nvim'
brew 'packer'
brew 'pipenv'
brew 'pv'
brew 'python'
brew 'ruby-install'
brew 'sbt'
brew 'tfenv'
brew 'tflint'
brew 'tmux'
brew 'vault'
brew 'starkandwayne/cf/safe'
brew 'weaveworks/tap/eksctl'

cask '1password'
cask '1password-cli'
cask 'adoptopenjdk8'
cask 'alfred'
cask 'aws-vault'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'keybase'
cask 'omnifocus'
cask 'omnigraffle'
cask 'paw'
cask 'pritunl'
cask 'slack'
cask 'the-unarchiver'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'zoomus'

mas 'AdGuard for Safari', id: 1440147259
mas 'Bear', id: 1091189122
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft OneNote', id: 784801555
mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704
